---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetPropertyDouble
source: html/a3af7f9b-ecb2-3334-8c04-8a2221ea3df1.htm
---
# AssetPropertyDouble Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.